<!DOCTYPE html>
<html lang="en-us">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    
    <title>Welcome to Rick&#39;s Page  | 虚继承和虚基类</title>
    <meta name="HandheldFriendly" content="True">
    <meta name="MobileOptimized" content="320">

    <meta name="viewport" content="width=device-width,minimum-scale=1">
    <meta name="generator" content="Hugo 0.52" />
    
    
      <META NAME="ROBOTS" CONTENT="NOINDEX, NOFOLLOW">
    

    
    
      <link href="/rick/dist/css/app.955516233bcafa4d2a1c13cea63c7b50.css" rel="stylesheet">
    

    

    
      
    

    

    <meta property="og:title" content="虚继承和虚基类" />
<meta property="og:description" content="虚继承和虚基类 参考
 在C&#43;&#43;中，在定义公共基类A的派生类B、C&hellip;的时候，如果在继承方式前使用关键字virtual对继承方式限定，这样的继承方式就是虚拟继承，公共基类A成为虚基类。这样，在具有公共基类的、使用了虚拟继承方式的多个派生类B、C&hellip;的公共派生类D中，该基类A的成员就只有一份拷贝 一个类有多个基类，这样的继承关系称为多继承。在多继承的情况下，如果不同基类的成员名称相同，匹配度相同, 则会造成二义性。为了避免多继承产生的二义性，在这种机制下，不论虚基类在继承体系中出现了多少次，在派生类中都只包含一份虚基类的成员。 会在虚继承的类中生成一个指向虚基类的指针 {vbptr} 会在内存中生成一个虚基类表 D::$vbtable@B@  微软的Visual Studio提供给用户显示C&#43;&#43;对象在内存中的布局的选项cl [filename].cpp /d1 reportSingleClassLayout[className]
一般继承：
class A { public: int dataA; }; class B:public A { public: int dataB; }; class C:public A { public: int dataC; }; class D : public B, public C { public: int dataD; };  输出：
class D size(20): &#43;--- 0 | &#43;--- (base class B) 0 | | &#43;--- (base class A) 0 | | | dataA | | &#43;--- 4 | | dataB | &#43;--- 8 | &#43;--- (base class C) 8 | | &#43;--- (base class A) 8 | | | dataA | | &#43;--- 12 | | dataC | &#43;--- 16 | dataD &#43;---  调用：" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://874656645.github.io/rick/posts/44-%E8%99%9A%E7%BB%A7%E6%89%BF%E5%92%8C%E8%99%9A%E5%9F%BA%E7%B1%BB/" /><meta property="article:published_time" content="2021-12-27T13:34:27&#43;08:00"/>
<meta property="article:modified_time" content="2021-12-27T13:34:27&#43;08:00"/>

<meta itemprop="name" content="虚继承和虚基类">
<meta itemprop="description" content="虚继承和虚基类 参考
 在C&#43;&#43;中，在定义公共基类A的派生类B、C&hellip;的时候，如果在继承方式前使用关键字virtual对继承方式限定，这样的继承方式就是虚拟继承，公共基类A成为虚基类。这样，在具有公共基类的、使用了虚拟继承方式的多个派生类B、C&hellip;的公共派生类D中，该基类A的成员就只有一份拷贝 一个类有多个基类，这样的继承关系称为多继承。在多继承的情况下，如果不同基类的成员名称相同，匹配度相同, 则会造成二义性。为了避免多继承产生的二义性，在这种机制下，不论虚基类在继承体系中出现了多少次，在派生类中都只包含一份虚基类的成员。 会在虚继承的类中生成一个指向虚基类的指针 {vbptr} 会在内存中生成一个虚基类表 D::$vbtable@B@  微软的Visual Studio提供给用户显示C&#43;&#43;对象在内存中的布局的选项cl [filename].cpp /d1 reportSingleClassLayout[className]
一般继承：
class A { public: int dataA; }; class B:public A { public: int dataB; }; class C:public A { public: int dataC; }; class D : public B, public C { public: int dataD; };  输出：
class D size(20): &#43;--- 0 | &#43;--- (base class B) 0 | | &#43;--- (base class A) 0 | | | dataA | | &#43;--- 4 | | dataB | &#43;--- 8 | &#43;--- (base class C) 8 | | &#43;--- (base class A) 8 | | | dataA | | &#43;--- 12 | | dataC | &#43;--- 16 | dataD &#43;---  调用：">


<meta itemprop="datePublished" content="2021-12-27T13:34:27&#43;08:00" />
<meta itemprop="dateModified" content="2021-12-27T13:34:27&#43;08:00" />
<meta itemprop="wordCount" content="376">



<meta itemprop="keywords" content="" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="虚继承和虚基类"/>
<meta name="twitter:description" content="虚继承和虚基类 参考
 在C&#43;&#43;中，在定义公共基类A的派生类B、C&hellip;的时候，如果在继承方式前使用关键字virtual对继承方式限定，这样的继承方式就是虚拟继承，公共基类A成为虚基类。这样，在具有公共基类的、使用了虚拟继承方式的多个派生类B、C&hellip;的公共派生类D中，该基类A的成员就只有一份拷贝 一个类有多个基类，这样的继承关系称为多继承。在多继承的情况下，如果不同基类的成员名称相同，匹配度相同, 则会造成二义性。为了避免多继承产生的二义性，在这种机制下，不论虚基类在继承体系中出现了多少次，在派生类中都只包含一份虚基类的成员。 会在虚继承的类中生成一个指向虚基类的指针 {vbptr} 会在内存中生成一个虚基类表 D::$vbtable@B@  微软的Visual Studio提供给用户显示C&#43;&#43;对象在内存中的布局的选项cl [filename].cpp /d1 reportSingleClassLayout[className]
一般继承：
class A { public: int dataA; }; class B:public A { public: int dataB; }; class C:public A { public: int dataC; }; class D : public B, public C { public: int dataD; };  输出：
class D size(20): &#43;--- 0 | &#43;--- (base class B) 0 | | &#43;--- (base class A) 0 | | | dataA | | &#43;--- 4 | | dataB | &#43;--- 8 | &#43;--- (base class C) 8 | | &#43;--- (base class A) 8 | | | dataA | | &#43;--- 12 | | dataC | &#43;--- 16 | dataD &#43;---  调用："/>

  </head>

  <body class="ma0 avenir bg-near-white">

    
   
  

  <header>
    <div class="bg-black">
      <nav class="pv3 ph3 ph4-ns" role="navigation">
  <div class="flex-l justify-between items-center center">
    <a href="https://874656645.github.io/rick/" class="f3 fw2 hover-white no-underline white-90 dib">
      Welcome to Rick&#39;s Page
    </a>
    <div class="flex-l items-center">
      
      
<div hidden>
  <span id="new-window-0">Opens in a new window</span>
  <span id="new-window-1">Opens an external site</span>
  <span id="new-window-2">Opens an external site in a new window</span>
</div>









    </div>
  </div>
</nav>

    </div>
  </header>



    <main class="pb7" role="main">
      
  
  <article class="flex-l flex-wrap justify-between mw8 center ph3 ph0-l">

    <header class="mt4 w-100">
      <p class="f6 b helvetica tracked">
          
        POSTS
      </p>
      <h1 class="f1 athelas mb1">虚继承和虚基类</h1>
      
      <time class="f6 mv4 dib tracked" datetime="2021-12-27T13:34:27&#43;08:00">December 27, 2021</time>      
      
      
    </header>

    <main class="nested-copy-line-height lh-copy serif f4 nested-links nested-img mid-gray pr4-l w-two-thirds-l">

<h2 id="虚继承和虚基类">虚继承和虚基类</h2>

<p><a href="https://blog.csdn.net/xiejingfa/article/details/48028491">参考</a></p>

<ul>
<li>在C++中，在定义公共基类A的派生类B、C&hellip;的时候，如果在继承方式前使用关键字virtual对继承方式限定，这样的继承方式就是虚拟继承，公共基类A成为<strong>虚基类</strong>。这样，在具有公共基类的、使用了虚拟继承方式的多个派生类B、C&hellip;的公共派生类D中，该基类A的成员就<strong>只有一份拷贝</strong></li>
<li>一个类有多个基类，这样的继承关系称为多继承。<strong>在多继承的情况下，如果不同基类的成员名称相同，匹配度相同, 则会造成二义性</strong>。为了避免多继承产生的二义性，在这种机制下，不论虚基类在继承体系中出现了多少次，在派生类中都只包含一份虚基类的成员。</li>
<li>会在虚继承的类中生成一个指向虚基类的指针 <code>{vbptr}</code></li>
<li>会在内存中生成一个虚基类表 <code>D::$vbtable@B@</code></li>
</ul>

<p><strong>微软的Visual Studio提供给用户显示C++对象在内存中的布局的选项<code>cl [filename].cpp /d1 reportSingleClassLayout[className]</code></strong></p>

<p>一般继承：</p>

<pre><code class="language-C++">class A
{
public:
    int dataA;
};
class B:public A
{
public:
    int dataB;
};
class C:public A
{
public:
    int dataC;
};
class D : public B, public C
{
public:
    int dataD;
};
</code></pre>

<p>输出：</p>

<pre><code class="language-text">class D size(20):
        +---
 0      | +--- (base class B)
 0      | | +--- (base class A)
 0      | | | dataA
        | | +---
 4      | | dataB
        | +---
 8      | +--- (base class C)
 8      | | +--- (base class A)
 8      | | | dataA
        | | +---
12      | | dataC
        | +---
16      | dataD
        +---
</code></pre>

<p>调用：</p>

<pre><code class="language-C++">int main( )
{
    D d;
    cout &lt;&lt; d.dataA &lt;&lt; endl;
    return 0;
}
</code></pre>

<p>调用输出：</p>

<pre><code class="language-text">Start
prog.cc:29:15: error: non-static member 'dataA' found in multiple base-class subobjects of type 'A':
    class D -&gt; class B -&gt; class A
    class D -&gt; class C -&gt; class A
    cout &lt;&lt; d.dataA &lt;&lt; endl;
              ^
prog.cc:9:9: note: member found by ambiguous name lookup
    int dataA;
        ^
1 error generated.
1
Finish
</code></pre>

<p>虚继承：</p>

<pre><code class="language-C++">class A
{
public:
    int dataA;
};
class B:virtual public A
{
public:
    int dataB;
};
class C:virtual public A
{
public:
    int dataC;
};
class D : public B, public C
{
public:
    int dataD;
};
</code></pre>

<p><code>B</code> 类输出：</p>

<pre><code class="language-text">class B size(12):
        +---
 0      | {vbptr}
 4      | dataB
        +---
        +--- (virtual base A)
 8      | dataA
        +---

B::$vbtable@:
 0      | 0
 1      | 8 (Bd(B+0)A)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               A       8       0       4 0
</code></pre>

<p><code>C</code> 类输出：</p>

<pre><code class="language-text">class C size(12):
        +---
 0      | {vbptr}
 4      | dataC
        +---
        +--- (virtual base A)
 8      | dataA
        +---

C::$vbtable@:
 0      | 0
 1      | 8 (Cd(C+0)A)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               A       8       0       4 0
</code></pre>

<p><code>D</code> 类输出：</p>

<pre><code class="language-text">class D size(24):
        +---
 0      | +--- (base class B)
 0      | | {vbptr}
 4      | | dataB
        | +---
 8      | +--- (base class C)
 8      | | {vbptr}
12      | | dataC
        | +---
16      | dataD
        +---
        +--- (virtual base A)
20      | dataA
        +---

D::$vbtable@B@:
 0      | 0
 1      | 20 (Dd(B+0)A)

D::$vbtable@C@:
 0      | 0
 1      | 12 (Dd(C+0)A)
vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               A      20       0       4 0
</code></pre>
<ul class="pa0">
  
</ul>
<div class="mt6">
        
      </div>
    </main>

    <aside class="w-30-l mt6-l">




</aside>

  </article>

    </main>
    <footer class="bg-black bottom-0 w-100 pa3" role="contentinfo">
  <div class="flex justify-between">
  <a class="f4 fw4 hover-white no-underline white-70 dn dib-ns pv2 ph3" href="https://874656645.github.io/rick/" >
    &copy; 2021 Welcome to Rick&#39;s Page
  </a>
    <div>
<div hidden>
  <span id="new-window-0">Opens in a new window</span>
  <span id="new-window-1">Opens an external site</span>
  <span id="new-window-2">Opens an external site in a new window</span>
</div>








</div>
  </div>
</footer>

    

  <script src="/rick/dist/js/app.3fc0f988d21662902933.js"></script>


  </body>
</html>
