<!DOCTYPE html>
<html lang="en-us">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    
    <title>Welcome to Rick&#39;s Page  | 多态总结</title>
    <meta name="HandheldFriendly" content="True">
    <meta name="MobileOptimized" content="320">

    <meta name="viewport" content="width=device-width,minimum-scale=1">
    <meta name="generator" content="Hugo 0.52" />
    
    
      <META NAME="ROBOTS" CONTENT="NOINDEX, NOFOLLOW">
    

    
    
      <link href="/rick/dist/css/app.955516233bcafa4d2a1c13cea63c7b50.css" rel="stylesheet">
    

    

    
      
    

    

    <meta property="og:title" content="多态总结" />
<meta property="og:description" content="多态总结 C&#43;&#43; 多态分类及实现  重载多态（Ad-hoc Polymorphism，编译期）：函数重载、运算符重载（静态多态） 子类多态（Subtype Polymorphism，运行期）：虚函数（动态多态） 参数多态（Parametric Polymorphism，编译期）：类模板、函数模板 强制多态（Coercion Polymorphism，编译期/运行期）：基本类型转换、自定义类型转换  虚表指针、虚函数指针、虚函数表  虚表指针：在含有虚函数的类的对象中，指向虚函数表的指针，在运行时确定 虚函数指针：指向虚函数的地址的指针 虚函数表：在程序只读数据段，存放虚函数指针，如果派生类实现了基类的某个虚函数，则在虚函数表中覆盖原本基类的那个虚函数指针，在编译时根据类的声明创建  class Shape { public: virtual ~Shape(){ cout &lt;&lt; &quot;~Shape()&quot; &lt;&lt; endl; } }; class Point { public: ~Point(){ cout &lt;&lt; &quot;~Point()&quot; &lt;&lt; endl; } private: int m_x{0}; int m_y{0}; char m_c; }; class Circle : public Shape { public: ~Circle(){ cout &lt;&lt; &quot;~Circle()&quot; &lt;&lt; endl; } private: Point m_p; }; int main( ) { // 8 类中存有指向虚函数表的指针 cout &lt;&lt; sizeof(Shape) &lt;&lt; endl; // 16 类中存有指向虚函数表的指针 // 以及Point对象的大小（此时Point类中不包含任何变量），虽然真实大小是 8 &#43; 1 // 但是额外多的1个字节导致内存大小扩增了 8(每次扩增的最小数值是8 &lt;alignment member&gt; (size=7)) cout &lt;&lt; sizeof(Circle) &lt;&lt; endl; // 8 类中的int占4个字节，char占1个字节 // 但每次扩增的最小数值是4(&lt;alignment member&gt; (size=3)) cout &lt;&lt; sizeof(Point) &lt;&lt; endl; Circle c; return 0; }  Start 8 24 12 ~Circle() ~Point() ~Shape() 0 Finish  Shape 类" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://874656645.github.io/rick/posts/43-%E5%A4%9A%E6%80%81%E6%80%BB%E7%BB%93/" /><meta property="article:published_time" content="2021-12-27T10:34:27&#43;08:00"/>
<meta property="article:modified_time" content="2021-12-27T10:34:27&#43;08:00"/>

<meta itemprop="name" content="多态总结">
<meta itemprop="description" content="多态总结 C&#43;&#43; 多态分类及实现  重载多态（Ad-hoc Polymorphism，编译期）：函数重载、运算符重载（静态多态） 子类多态（Subtype Polymorphism，运行期）：虚函数（动态多态） 参数多态（Parametric Polymorphism，编译期）：类模板、函数模板 强制多态（Coercion Polymorphism，编译期/运行期）：基本类型转换、自定义类型转换  虚表指针、虚函数指针、虚函数表  虚表指针：在含有虚函数的类的对象中，指向虚函数表的指针，在运行时确定 虚函数指针：指向虚函数的地址的指针 虚函数表：在程序只读数据段，存放虚函数指针，如果派生类实现了基类的某个虚函数，则在虚函数表中覆盖原本基类的那个虚函数指针，在编译时根据类的声明创建  class Shape { public: virtual ~Shape(){ cout &lt;&lt; &quot;~Shape()&quot; &lt;&lt; endl; } }; class Point { public: ~Point(){ cout &lt;&lt; &quot;~Point()&quot; &lt;&lt; endl; } private: int m_x{0}; int m_y{0}; char m_c; }; class Circle : public Shape { public: ~Circle(){ cout &lt;&lt; &quot;~Circle()&quot; &lt;&lt; endl; } private: Point m_p; }; int main( ) { // 8 类中存有指向虚函数表的指针 cout &lt;&lt; sizeof(Shape) &lt;&lt; endl; // 16 类中存有指向虚函数表的指针 // 以及Point对象的大小（此时Point类中不包含任何变量），虽然真实大小是 8 &#43; 1 // 但是额外多的1个字节导致内存大小扩增了 8(每次扩增的最小数值是8 &lt;alignment member&gt; (size=7)) cout &lt;&lt; sizeof(Circle) &lt;&lt; endl; // 8 类中的int占4个字节，char占1个字节 // 但每次扩增的最小数值是4(&lt;alignment member&gt; (size=3)) cout &lt;&lt; sizeof(Point) &lt;&lt; endl; Circle c; return 0; }  Start 8 24 12 ~Circle() ~Point() ~Shape() 0 Finish  Shape 类">


<meta itemprop="datePublished" content="2021-12-27T10:34:27&#43;08:00" />
<meta itemprop="dateModified" content="2021-12-27T10:34:27&#43;08:00" />
<meta itemprop="wordCount" content="228">



<meta itemprop="keywords" content="" />
<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="多态总结"/>
<meta name="twitter:description" content="多态总结 C&#43;&#43; 多态分类及实现  重载多态（Ad-hoc Polymorphism，编译期）：函数重载、运算符重载（静态多态） 子类多态（Subtype Polymorphism，运行期）：虚函数（动态多态） 参数多态（Parametric Polymorphism，编译期）：类模板、函数模板 强制多态（Coercion Polymorphism，编译期/运行期）：基本类型转换、自定义类型转换  虚表指针、虚函数指针、虚函数表  虚表指针：在含有虚函数的类的对象中，指向虚函数表的指针，在运行时确定 虚函数指针：指向虚函数的地址的指针 虚函数表：在程序只读数据段，存放虚函数指针，如果派生类实现了基类的某个虚函数，则在虚函数表中覆盖原本基类的那个虚函数指针，在编译时根据类的声明创建  class Shape { public: virtual ~Shape(){ cout &lt;&lt; &quot;~Shape()&quot; &lt;&lt; endl; } }; class Point { public: ~Point(){ cout &lt;&lt; &quot;~Point()&quot; &lt;&lt; endl; } private: int m_x{0}; int m_y{0}; char m_c; }; class Circle : public Shape { public: ~Circle(){ cout &lt;&lt; &quot;~Circle()&quot; &lt;&lt; endl; } private: Point m_p; }; int main( ) { // 8 类中存有指向虚函数表的指针 cout &lt;&lt; sizeof(Shape) &lt;&lt; endl; // 16 类中存有指向虚函数表的指针 // 以及Point对象的大小（此时Point类中不包含任何变量），虽然真实大小是 8 &#43; 1 // 但是额外多的1个字节导致内存大小扩增了 8(每次扩增的最小数值是8 &lt;alignment member&gt; (size=7)) cout &lt;&lt; sizeof(Circle) &lt;&lt; endl; // 8 类中的int占4个字节，char占1个字节 // 但每次扩增的最小数值是4(&lt;alignment member&gt; (size=3)) cout &lt;&lt; sizeof(Point) &lt;&lt; endl; Circle c; return 0; }  Start 8 24 12 ~Circle() ~Point() ~Shape() 0 Finish  Shape 类"/>

  </head>

  <body class="ma0 avenir bg-near-white">

    
   
  

  <header>
    <div class="bg-black">
      <nav class="pv3 ph3 ph4-ns" role="navigation">
  <div class="flex-l justify-between items-center center">
    <a href="https://874656645.github.io/rick/" class="f3 fw2 hover-white no-underline white-90 dib">
      Welcome to Rick&#39;s Page
    </a>
    <div class="flex-l items-center">
      
      
<div hidden>
  <span id="new-window-0">Opens in a new window</span>
  <span id="new-window-1">Opens an external site</span>
  <span id="new-window-2">Opens an external site in a new window</span>
</div>









    </div>
  </div>
</nav>

    </div>
  </header>



    <main class="pb7" role="main">
      
  
  <article class="flex-l flex-wrap justify-between mw8 center ph3 ph0-l">

    <header class="mt4 w-100">
      <p class="f6 b helvetica tracked">
          
        POSTS
      </p>
      <h1 class="f1 athelas mb1">多态总结</h1>
      
      <time class="f6 mv4 dib tracked" datetime="2021-12-27T10:34:27&#43;08:00">December 27, 2021</time>      
      
      
    </header>

    <main class="nested-copy-line-height lh-copy serif f4 nested-links nested-img mid-gray pr4-l w-two-thirds-l">

<h2 id="多态总结">多态总结</h2>

<h3 id="c-多态分类及实现"><code>C++</code> 多态分类及实现</h3>

<ul>
<li>重载多态（Ad-hoc Polymorphism，编译期）：函数重载、运算符重载（静态多态）</li>
<li>子类多态（Subtype Polymorphism，运行期）：虚函数（动态多态）</li>
<li>参数多态（Parametric Polymorphism，编译期）：类模板、函数模板</li>
<li>强制多态（Coercion Polymorphism，编译期/运行期）：基本类型转换、自定义类型转换</li>
</ul>

<h3 id="虚表指针-虚函数指针-虚函数表">虚表指针、虚函数指针、虚函数表</h3>

<ul>
<li>虚表指针：在含有虚函数的类的对象中，指向虚函数表的指针，在运行时确定</li>
<li>虚函数指针：指向虚函数的地址的指针</li>
<li>虚函数表：在程序只读数据段，存放虚函数指针，如果派生类实现了基类的某个虚函数，则在虚函数表中覆盖原本基类的那个虚函数指针，在编译时根据类的声明创建</li>
</ul>

<pre><code class="language-C++">class Shape
{
public:
    virtual ~Shape(){
        cout &lt;&lt; &quot;~Shape()&quot; &lt;&lt; endl;
    }
};
class Point
{
public:
    ~Point(){
        cout &lt;&lt; &quot;~Point()&quot; &lt;&lt; endl;
    }
private:
    int m_x{0};
    int m_y{0};
    char m_c;
};
class Circle : public Shape
{
public:
    ~Circle(){
        cout &lt;&lt; &quot;~Circle()&quot; &lt;&lt; endl;
    }
private:
    Point m_p;
};
int main( )
{
    // 8    类中存有指向虚函数表的指针
    cout &lt;&lt; sizeof(Shape) &lt;&lt; endl;
    // 16   类中存有指向虚函数表的指针
    //      以及Point对象的大小（此时Point类中不包含任何变量），虽然真实大小是 8 + 1
    //      但是额外多的1个字节导致内存大小扩增了 8(每次扩增的最小数值是8 &lt;alignment member&gt; (size=7))
    cout &lt;&lt; sizeof(Circle) &lt;&lt; endl;
    // 8    类中的int占4个字节，char占1个字节
    //      但每次扩增的最小数值是4(&lt;alignment member&gt; (size=3))
    cout &lt;&lt; sizeof(Point) &lt;&lt; endl;

    Circle c;
    return 0;
}
</code></pre>

<pre><code class="language-text">Start
8
24
12
~Circle()
~Point()
~Shape()
0
Finish
</code></pre>

<p><code>Shape</code> 类</p>

<pre><code class="language-text">// 没有虚函数
class Shape     size(1):
        +---
        +---

// 有虚析构函数
class Shape     size(8):
        +---
 0      | {vfptr}
        +---

Shape::$vftable@:
        | &amp;Shape_meta
        |  0
 0      | &amp;Shape::{dtor}

Shape::{dtor} this adjustor: 0
Shape::__delDtor this adjustor: 0
Shape::__vecDelDtor this adjustor: 0
</code></pre>

<p><code>Point</code> 类</p>

<pre><code class="language-text">class Point     size(8):
        +---
 0      | m_x
 4      | m_y
 8      | m_c
        | &lt;alignment member&gt; (size=3)
        +---
</code></pre>

<p><code>Circle</code> 类</p>

<pre><code class="language-text">class Circle    size(24):
        +---
 0      | +--- (base class Shape)
 0      | | {vfptr}
        | +---
 8      | Point m_p
        | &lt;alignment member&gt; (size=4)
        +---

Circle::$vftable@:
        | &amp;Circle_meta
        |  0
 0      | &amp;Circle::{dtor}

Circle::{dtor} this adjustor: 0
Circle::__delDtor this adjustor: 0
Circle::__vecDelDtor this adjustor: 0
</code></pre>
<ul class="pa0">
  
</ul>
<div class="mt6">
        
      </div>
    </main>

    <aside class="w-30-l mt6-l">




</aside>

  </article>

    </main>
    <footer class="bg-black bottom-0 w-100 pa3" role="contentinfo">
  <div class="flex justify-between">
  <a class="f4 fw4 hover-white no-underline white-70 dn dib-ns pv2 ph3" href="https://874656645.github.io/rick/" >
    &copy; 2021 Welcome to Rick&#39;s Page
  </a>
    <div>
<div hidden>
  <span id="new-window-0">Opens in a new window</span>
  <span id="new-window-1">Opens an external site</span>
  <span id="new-window-2">Opens an external site in a new window</span>
</div>








</div>
  </div>
</footer>

    

  <script src="/rick/dist/js/app.3fc0f988d21662902933.js"></script>


  </body>
</html>
